## Plan Result (Managed_Identity_Infrastructure_sbox)




<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment
  * azurerm_role_assignment.rbac_admin[&#34;047fc0c7-abf4-405c-ac3f-5f1f9527c9e7&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;173fde48-bd6b-44f1-bb63-6fe6c90424ca&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;2070d748-c35c-478f-a5ca-ec8a5c4ff10d&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;7fa5dd91-6812-42cc-a93f-377f7d4c9e1e&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;933c1e6e-7915-4ac9-aee2-f0a67ba626ae&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;98053eb3-8523-4c5a-96d3-c15532f87c19&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;a9a3b951-3f7d-46f5-a2d5-e0ecb41bcfd3&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;b8f08f77-4ce2-43d5-a23b-c7ca735eca02&#34;]
  * azurerm_role_assignment.rbac_admin[&#34;c822a60c-d948-46f2-a4ce-b1c7ecd33f2f&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "monitoring_mi_assignment" {
      + account_name        = "sandbox-pipeline-metrics"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "2e8e0b87-1d23-4151-b396-8ed1e44a3eb4"
      + resource_group_name = "pipelinemetrics-database-sandbox"
      + role_definition_id  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
    }

  # azurerm_role_assignment.rbac_admin["047fc0c7-abf4-405c-ac3f-5f1f9527c9e7"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "047fc0c7-abf4-405c-ac3f-5f1f9527c9e7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["173fde48-bd6b-44f1-bb63-6fe6c90424ca"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "173fde48-bd6b-44f1-bb63-6fe6c90424ca"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["2070d748-c35c-478f-a5ca-ec8a5c4ff10d"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2070d748-c35c-478f-a5ca-ec8a5c4ff10d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["7fa5dd91-6812-42cc-a93f-377f7d4c9e1e"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7fa5dd91-6812-42cc-a93f-377f7d4c9e1e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["933c1e6e-7915-4ac9-aee2-f0a67ba626ae"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "933c1e6e-7915-4ac9-aee2-f0a67ba626ae"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["98053eb3-8523-4c5a-96d3-c15532f87c19"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98053eb3-8523-4c5a-96d3-c15532f87c19"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["a9a3b951-3f7d-46f5-a2d5-e0ecb41bcfd3"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9a3b951-3f7d-46f5-a2d5-e0ecb41bcfd3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["b8f08f77-4ce2-43d5-a23b-c7ca735eca02"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b8f08f77-4ce2-43d5-a23b-c7ca735eca02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac_admin["c822a60c-d948-46f2-a4ce-b1c7ecd33f2f"] will be created
  + resource "azurerm_role_assignment" "rbac_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c822a60c-d948-46f2-a4ce-b1c7ecd33f2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DocumentDB Account Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":190,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity_Infrastructure_sbox","Vars":{}} -->